Wind_Dune_Egmond/run_angle45/0/thicknessFraction
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thicknessFraction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            cyclic;
    }
    Back
    {
        type            cyclic;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    upperPatch
    {
        type            fixedValue;
        value           uniform 0;
    }
    ground
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
8153
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
